/*****************************************************************************
* File    : GC_main.ino
* Author  : 惜枫醉
* Date    : 2017/04/06
* Brief   : 车库控制器主程序
*
* Copyright (c) 2000-2020 惜枫醉 All Rights Reserved.
* Remarks :修改日志
******************************************************************************/


/*****************************************************************************
*                               头文件引用
******************************************************************************/
//arduino头文件都要包在主文件里，还是比较奇怪的,还有 所有函数都不需要预先声明，但C++部分又是要声明的。
#include <MsTimer2.h>
#include <avr/pgmspace.h>
#include <EEPROM.h>
//#include <Wire.h>
#include "GC_eeprom.h"
#include "GC_def.h"
#include "GC_key.h"
#include "GC_relay.h"
#include "GC_timer.h"
#include "GC_oled.h"
#include "GC_oledFont.h"
#include "GC_menu.h"
#include "GC_wifi.h"
/*****************************************************************************
*                                常量定义
******************************************************************************/


/*****************************************************************************
*                                 宏定义
******************************************************************************/
#define DMSG
#ifdef DMSG
    #define dbgMsg(x) do{\
        char *dbgStr = PSTR(x);\
        while(pgm_read_byte(dbgStr) != NULL)\
        {\
            Serial.write(pgm_read_byte(dbgStr));\
            dbgStr++;\
        }\
        Serial.write('\n');\
    }while(0)
        
#else
    #define dbgMsg(x) 
#endif

/*****************************************************************************
*                              数据类型定义
******************************************************************************/


/*****************************************************************************
*                                函数声明
******************************************************************************/


/*****************************************************************************
*                                变量定义
******************************************************************************/

void setup()
{
    int ret = NULL;
    Serial.begin(9600);
    EEPROM_init();
    TIMER_init();
    OLED_init();
    KEY_init();
	RELAY_init();
    delay(1000);
    WIFI_init();
    APP_menuGen();//生成菜单，如果对菜单逻辑有疑问，可以参考此代码
    
    
}   

void loop() 
{
    APP_menuLogic();
    APP_backgroundService();
    APP_timerServiceBody();
}

